       IDENTIFICATION DIVISION.
       PROGRAM-ID. PTPCRYPG.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-COMMAND.
          05 FILLER PIC X(16) VALUE "./gpgencrypt.sh ".
          05 FILLER PIC X(24) VALUE "ankur.katiyar@gmail.com ".
          05 WS-STRING PIC X(100).

       LINKAGE SECTION.
       01 LN-PLAINTEXT-ARG.
          05 LN-PLAINTEXT-LENGTH  PIC 9(4) COMP-5.
          05 LN-PLAINTEXT         PIC X(100).

       PROCEDURE DIVISION USING LN-PLAINTEXT-ARG.
       MAIN-PARA.
           MOVE LN-PLAINTEXT TO WS-STRING.
           CALL "SYSTEM" USING WS-COMMAND.
           STOP RUN.